import re
import requests
from bs4 import BeautifulSoup


find_name=re.compile(r'">(.*?)</a><br/>')
find_symb=re.compile(r'"#999999">(.*?)</font></li>')


button=input()
button=button.split(',')
val=''
desc={}
reslist=["消瘦",",休克",",昏迷",",晕厥",",发热",",抽筋",\
    ",疲劳",",贫血",",猝死",",瘫痪",",脱水",",身痛",\
    ",腰背痛",",神经痛",",出汗异常",",体型异常",",癫痫和癫痫样发作",\
    ",肥胖症",",感觉障碍",",佝楼病",",毛发异常",",肌肉萎缩",\
    ",肌性肌无力",",脊柱和四肢畸形",\
    ",鼻出血",",鼻溢液",",恶心与呕吐",",耳痛",",耳鸣",",耳溢液",",呼吸异常",\
    "红眼",",呼吸衰竭",",颈肩痛",",口腔痛",",口臭",",溃疡",",咳痰",",咳嗽",\
    ",声音嘶哑",",食欲异常",",色素异常",",色觉异常",",眼痛",",眼球震颤",",眼球突出",\
    ",眼球内陷",",头痛",",听力减退",",瞳孔异常",",吞咽困难",",呕血",",颈静脉怒张",\
    ",角膜混浊",",咽痛",",咽炎、舌炎、龈炎",",言语障碍",",牙齿异常",",眼球运动障碍",\
    ",咽部异物感",",呃逆",",脑膜刺激征",",咯血",",眩晕",",腮腺区肿大",",呼吸性酸中毒",\
    ",呼吸性碱中毒",",气息异常",",泪溢",",啰音",",视力障碍",",急性呼吸窘迫综合征",\
    ",气胸",",胸痛",",心悸",",男性乳房发育症",",乳汁分泌减少",",乳糜尿",",乳溢一高泌乳素血症",\
    ",心包积液",",心力衰竭",",心音异常",",心脏震颤",",心脏杂音",",心律失常",",心脏增大",\
    ",胸廓异常",",胸腔积液",",脾肿大",\
    ",腹痛",",腹水",",腹泻",",肺水肿",",腹部肿块",",肝肿大",",胃肠气胀",",胃食管反流性疾病",\
    ",肾病综合征",",慢性肾衰竭",",急性肾衰竭",\
    ",杵状指（趾）",",步态异常",",不自主运动",",关节疼痛",",指甲异常",\
    ",斑疹",",风团",",黄疸",",水肿",",丘疹",",皮肤硬化",",疱疹",",鳞屑",",脓疱",",瘙痒",",紫绀",\
    ",血尿",",糖尿",",黑便",",少尿",",尿失禁与遗尿",",尿频伴尿急和尿痛",",排尿困难及尿潴留",\
    ",脓尿",",白带",",便血",",便秘",",多尿",",血红蛋白尿",",蛋白尿",\
    ",两性畸形",",性早熟",",性幼稚病",",阴道出血",",阴囊肿大",",男子性功能障碍",",囊肿",",痛经",",闭经",",女性不孕",",男性不育",\
    ",低血压",",低镁血症",",低钠血症",",低钾血症",",低钙血症",",低血糖症",",代谢性酸中毒",",低颅压综合征", ",代谢性碱中毒",\
    ",黏膜损害",",无脉症",",水中毒",",盆腔肿块",",混合型酸碱平衡紊乱",",淋巴结肿大",",雷诺现象",",直肠与肛门狭窄",\
    ",周围血管征",",共济失调",",高颅压综合征",",高血压",",高钙血症",",高钾血症",",高镁血症",",骨质疏松",",高钠血症",",毛细血管扩张症",\
    ",甲状腺肿",",交替脉",",结节"]
for i in range(1,len(reslist)+1):
    desc[str(i)]=reslist[i-1]
for i in button:
    if i=='':continue
    if i in desc:
        val+=desc[i]
            

url='https://jibing.bmcx.com/'+val+'__jibing/'
headers={'User-Agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36'}
gethtml=requests.get(url,headers)
soup=BeautifulSoup(gethtml.text,'lxml')

for i in range(1,30):
    sick=soup.select('#main_content > ul > li:nth-child('+str(i)+')')
    if sick==[]:break
    sickname=re.findall(find_name,str(sick[0]))[0]
    sicksymp=re.findall(find_symb,str(sick[0]))[0]
    print(sickname+'\n'+sicksymp)

